In [3]:
import pandas as pd
stocks = pd.read_csv("data/car_stocks.csv")

In [2]:
stocks.head(1)

,Symbol,Date,Open,High,Low,Close,Adj Close,Volume
0,RIVN,2021-11-10,106.75,119.459999,95.199997,100.730003,100.730003,103679500

**How to get the avg price for each of GM, RIVN, etc in one go**

In [6]:
df = stocks.groupby("Symbol")
df

In [10]:
stocks.groupby("Symbol")["Close"].mean()

Symbol
GM       62.164615
LCID     49.829231
RIVN    127.523077
Name: Close, dtype: float64

In [11]:
titanic =  pd.read_csv("data/titanic.csv")
titanic["age"]  = pd.to_numeric(titanic["age"], errors = "coerce")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: float64(1), int64(4), object(9)
memory usage: 143.3+ KB

In [12]:
df = titanic[["pclass", "survived" , "sex" , "age"]]

In [13]:
df.head(1)

   pclass  survived     sex   age
0       1         1  female  29.0

In [15]:
gbo = df.groupby("sex") ##this will just create a groupby object and not actually return anything

In [16]:
gbo.ngroups

2

In [18]:
gbo.groups ##mapping of all indices against different groups

{'female': [0, 2, 4, 6, 8, 11, 12, 13, 17, 18, 21, 23, 24, 27, 28, 32, 33, 35, 36, 41, 42, 43, 44, 48, 50, 55, 57, 59, 61, 63, 65, 66, 67, 69, 72, 73, 76, 78, 79, 82, 83, 85, 88, 90, 92, 95, 97, 98, 99, 102, 103, 104, 105, 107, 108, 111, 112, 113, 116, 117, 121, 122, 124, 127, 129, 130, 131, 134, 137, 139, 141, 144, 146, 149, 153, 155, 159, 160, 161, 163, 167, 168, 169, 176, 178, 180, 181, 182, 186, 187, 188, 190, 192, 193, 195, 198, 199, 204, 207, 208, ...], 'male': [1, 3, 5, 7, 9, 10, 14, 15, 16, 19, 20, 22, 25, 26, 29, 30, 31, 34, 37, 38, 39, 40, 45, 46, 47, 49, 51, 52, 53, 54, 56, 58, 60, 62, 64, 68, 70, 71, 74, 75, 77, 80, 81, 84, 86, 87, 89, 91, 93, 94, 96, 100, 101, 106, 109, 110, 114, 115, 118, 119, 120, 123, 125, 126, 128, 132, 133, 135, 136, 138, 140, 142, 143, 145, 147, 148, 150, 151, 152, 154, 156, 157, 158, 162, 164, 165, 166, 170, 171, 172, 173, 174, 175, 177, 179, 183, 184, 185, 189, 191, ...]}

In [19]:
gbo.first() ## will give the first member of each element of the group

        pclass  survived      age
sex
female       1         1  29.0000
male         1         1   0.9167

In [21]:
gbo.get_group("female") ## will give all elements and all values of a single group

      pclass  survived     sex   age
0          1         1  female  29.0
2          1         0  female   2.0
4          1         0  female  25.0
6          1         1  female  63.0
8          1         1  female  53.0
...      ...       ...     ...   ...
1286       3         1  female  38.0
1290       3         1  female  47.0
1300       3         1  female  15.0
1304       3         0  female  14.5
1305       3         0  female   NaN

[466 rows x 4 columns]

In [22]:
## can even iterate over the groups

for name, group in gbo:
    print(name)
    print("XXXXXXXXXX")
    print(group)

female
XXXXXXXXXX
      pclass  survived     sex   age
0          1         1  female  29.0
2          1         0  female   2.0
4          1         0  female  25.0
6          1         1  female  63.0
8          1         1  female  53.0
...      ...       ...     ...   ...
1286       3         1  female  38.0
1290       3         1  female  47.0
1300       3         1  female  15.0
1304       3         0  female  14.5
1305       3         0  female   NaN

[466 rows x 4 columns]
male
XXXXXXXXXX
      pclass  survived   sex      age
1          1         1  male   0.9167
3          1         0  male  30.0000
5          1         1  male  48.0000
7          1         0  male  39.0000
9          1         0  male  71.0000
...      ...       ...   ...      ...
1302       3         0  male      NaN
1303       3         0  male      NaN
1306       3         0  male  26.5000
1307       3         0  male  27.0000
1308       3         0  male  29.0000

[843 rows x 4 columns]

<h3> Split, Apply, Combine </h3>

- **Split the data into different groups based on some criteria**
- **Apply function(s) to each group indpeendently**
- **Combine the results into a new data structure**

In [25]:
gbo["age"].mean() ##will give avg age of differnet groups

sex
female    28.687071
male      30.585233
Name: age, dtype: float64

In [26]:
titanic.groupby("pclass")["age"].mean()

pclass
1    39.159918
2    29.506705
3    24.816367
Name: age, dtype: float64

In [27]:
titanic.groupby("sex")["pclass"].mean()

sex
female    2.154506
male      2.372479
Name: pclass, dtype: float64

In [32]:
titanic.groupby("sex").mean(numeric_only = True) ## will give mean for each group for each of the remaining columns

          pclass  survived        age     sibsp     parch
sex
female  2.154506  0.727468  28.687071  0.652361  0.633047
male    2.372479  0.190985  30.585233  0.413998  0.247924

<h3> Using the agg function </h3>

**running multiple functions on a groupby object**

In [37]:
titanic.groupby("sex")["age"].agg(["min", "max", "mean", "median"]) ## mention all the functinos you want the operation to run on

           min   max       mean  median
sex
female  0.1667  76.0  28.687071    27.0
male    0.3333  80.0  30.585233    28.0

**Can even specify that for which column we want to run which type of functions**

In [40]:
titanic.groupby("sex").agg({"age": ["min", "max"], 
                                   "pclass": ["mean", "median"]})

           age          pclass
           min   max      mean median
sex
female  0.1667  76.0  2.154506    2.0
male    0.3333  80.0  2.372479    3.0

<h3> Agg with custom functions </h3>

In [42]:
def range(x):
    return x.max() - x.min()

titanic.groupby("pclass")["age"].agg(range) ## agg function automatically passes x param to range function and we dont have to specifically pass it

pclass
1    79.0833
2    69.3333
3    73.8333
Name: age, dtype: float64

In [45]:
def count_nulls(series):
    return series.size - series.count()

titanic.groupby("pclass")["age"].agg(count_nulls)

pclass
1     39
2     16
3    208
Name: age, dtype: int64

<h3> Named Aggregation</h3>

In [48]:
stocks.groupby("Symbol").agg(
    min_open = ("Open", "min"),
    max_open = ("Open", "max"),
    min_close = ("Close", "min"),
    max_close = ("Close", "max"),
) ##we can define the exact column names which we want to get

## we can

          min_open    max_open   min_close   max_close
Symbol
GM       57.849998   64.330002   59.270000   64.610001
LCID     42.299999   56.200001   40.750000   55.520000
RIVN    106.750000  163.800003  100.730003  172.009995